Tekla Open API Reference for Tekla Structures 2025
AnalysisModelDesignProperties.DesignMethodEnum Enumeration
 The design methods.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum DesignMethodEnum
Public Enumeration DesignMethodEnum
Members
Member name | Value | Description
NONE | 1 |  The design method is none.
CHECK_DESIGN | 2 |  The design method is check design.
OPTIMISE | 3 |  The design method is optimise.
See Also
Reference
Tekla.Structures.Analysis Namespace